src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/combustion/rhoReactingFoam/groundAbsorption/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    "(outlet|sides)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    base
    {
//        type            zeroGradient;

        type            enthalpySorption;
        enthalpyModel   calculated;
        enthalpyTable
        {
            type        table;
            values
            (
                (0    0)
                (1e-2 1e4)
                (4e-2 2e4)
            );
        }
        species         CH4;
        includeHs       true;
        Hvap            1e6;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
}


// ************************************************************************* //
